# Taps
tap 'homebrew/cask-cask'
tap 'homebrew/cask-fonts'
tap 'adoptopenjdk/openjdk'
tap 'dart-lang/dart'
tap 'github/gh'

# Languages
brew 'dart'
brew 'go'
brew 'rust'
brew 'mono'
brew 'node'
brew 'python'
brew 'python3'
cask 'adoptopenjdk'
cask 'dotnet-sdk'

# Brew Packages
brew 'starship'
brew 'neovim'
brew 'firebase-cli'
brew 'gh'
brew 'ios-deploy'

# Media manipulation
brew 'ffmpeg'
brew 'imagemagick'

# General Applications
cask 'google-chrome'
cask 'vlc'
cask 'spotify'
cask 'discord'
cask 'aerial'
cask 'multimc'
cask 'figma'
cask 'daisydisk'
cask 'clockify'
cask 'forklift'
cask 'grammarly'
cask 'fantastical'
cask 'authy'
cask 'adobe-creative-cloud'

# Development Applications
cask 'atom'
cask 'visual-studio-code'
cask 'github'
cask 'gitkraken'
cask 'jetbrains-toolbox'
cask 'iterm2'
cask 'insomnia'
cask 'insomnia-designer'
cask 'gpg-suite'
cask 'docker'
cask 'google-cloud-sdk'
